brew 'aspell'
brew 'bat'
brew 'editorconfig'
brew 'emacs'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git-delta'
brew 'less'
brew 'nnn'
brew 'nvim'
# For man files
brew 'pandoc'
brew 'ripgrep'
brew 'tig'
brew 'tmux'
brew 'universal-ctags'
brew 'vim'
brew 'zoxide'
brew 'zsh'
