brew 'bat'
brew 'editorconfig'
brew 'fd'
brew 'fish'
brew 'fzf'
brew 'gh'
brew 'git-delta'
brew 'helix'
brew 'less'
brew 'yazi'
brew 'nvim'
brew 'ripgrep'
brew 'tig'
brew 'universal-ctags'
brew 'vim'
brew 'zoxide'
brew 'zsh'
