# Homebrew `aspell` is failing to install on macOS
# brew 'aspell'
# `ispell` installs instantly
brew 'ispell'
brew 'cscope'
brew 'editorconfig'
brew 'fd'
# for `zoxide` `zi` to go to recent directories
brew 'gh'
brew 'git-delta'
brew 'nnn'
# For man files
brew 'pandoc'
brew 'ripgrep'
brew 'tig'
brew 'tmux'
brew 'universal-ctags'
brew 'vim'
brew 'zoxide'
brew 'zsh'
