# Shell
brew 'zsh'
brew 'git'
brew 'tig'
brew 'fzf'
brew 'tmux'
brew 'ripgrep'
brew 'fd'
brew 'bat'
# Support for `incsearch`
brew 'less'
brew 'zoxide'
brew 'nnn'
# Really useful to see diff by word quickly
brew 'git-delta'
# Modern
brew 'nushell'
brew 'fish'
brew 'helix'

# Editor
brew 'aspell'
brew 'neovim'
brew 'vim'
brew 'editorconfig'

# Languages
# JavaScript
# Do not use homebrew `nvm` because it overrides `NVM_DIR` which causes issues.
# Instead install `nvm` directly.
# Ruby
brew 'chruby'
brew 'ruby-install'
# Swift
# Objective-C
brew 'carthage'
brew 'clang-format'
# MIDI
# Go
brew 'go'
brew 'jq'
# Rust
brew 'wasm-pack'
brew 'rust-analyzer'
# lua
brew 'lua-language-server'
# Markdown
brew 'marksman'

# Special
brew 'pandoc'
brew 'gh'
brew 'cloc'
brew 'ncdu'
# HEAD for truecolor support
brew 'mosh', args: ['HEAD']
brew 'youtube-dl'
brew 'mitmproxy'
brew 'hyperfine'
# Shows whitespace nicer than xxd
brew 'hexyl'

# macOS
brew 'suspicious-package'

# Cask GUI Apps
tap 'homebrew/cask'
cask 'blender'
cask 'godot'
cask 'anki'
cask 'alacritty'

# Media
brew 'ffmpeg'
brew 'imagemagick'

# Games
brew 'nethack'

# VS Code
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.github-vscode-theme"
vscode "GrapeCity.gc-excelviewer"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "jmfirth.vsc-space-block-jumper"
vscode "johnpapa.vscode-peacock"
vscode "kavod-io.vscode-jest-test-adapter"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lunaryorn.fish-ide"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "ms-dotnettools.csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "msjsdiag.debugger-for-edge"
vscode "rebornix.ruby"
vscode "ritwickdey.LiveServer"
vscode "RobbOwen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "skyapps.fish-vscode"
vscode "sleistner.vscode-fileutils"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "travisthetechie.write-good-linter"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
vscode "xaver.clang-format"
vscode "yhirose.FilterText"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
