# Shell
brew 'zsh'
brew 'fish'
brew 'git'
brew 'tig'
brew 'fzf'
brew 'helix'
brew 'tmux'
brew 'ripgrep'
brew 'fd'
brew 'bat'
brew 'mas'
brew 'rename'
# Support for `incsearch`
brew 'less'
brew 'wget'
brew 'git-delta'
brew 'choose-rust'
brew 'nushell'
brew 'zoxide'
brew 'nnn'
brew 'scrcpy'

# Editor
brew 'aspell'
# Required before `ctags`
# brew 'svn'
# Remove this in favor of LSP support because it sometimes has problems compiling
# Head version of `ctags` contains support for Objective-C
# brew 'ctags', args: ['HEAD']
brew 'vim'
brew 'neovim'
brew 'editorconfig'

# Languages
# JavaScript
# Do not use homebrew `nvm` because it overrides `NVM_DIR` which causes issues.
# Instead install `nvm` directly.
# Ruby
brew 'chruby'
brew 'ruby-install'
# Shell
brew 'shellcheck'
# Swift
# Objective-C
brew 'carthage'
brew 'clang-format'
# MIDI
brew 'midicsv'
# C
# Failing on Apple Silicon
# tap 'LouisBrunner/valgrind'
# brew 'LouisBrunner/valgrind/valgrind', args: ['HEAD']
# Go
brew 'go'
brew 'jq'
# Rust
brew 'wasm-pack'
brew 'rust-analyzer'
# lua
brew 'lua-language-server'

# Special
brew 'pandoc'
brew 's3cmd'
brew 'gnu-typist'
brew 'w3m'
brew 'gh'
brew 'cloc'
brew 'id3lib'
brew 'ncdu'
# HEAD for truecolor support
brew 'mosh', args: ['HEAD']
brew 'youtube-dl'
brew 'wdiff'
brew 'mitmproxy'
brew 'neofetch'
brew 'hyperfine'
brew 'sd'

# macOS
brew 'suspicious-package'

# Railwaycat
# tap 'railwaycat/emacsmacport'
# brew 'emacs-mac'
# The `with-no-frame-refocus` options on this version of Emacs fixes the issue
# of switching spaces when the last Emacs window on a space closes.
# Note after installing run `brew info emacs-plus` for the command to symlink
# to applications
# tap 'd12frosted/emacs-plus'
# brew 'emacs-plus', args: ['with-elrumo2-icon', 'with-no-frame-refocus']
# Just install from binary, not worth dealing with Homebrew symlinks and
# dependencies
# brew 'emacs'

# Cask GUI Apps
tap 'homebrew/cask'
# cask 'emacs'
cask 'blender'
cask 'anki'
cask 'alacritty'

# Animated GIFs, `gifify` dependencies
brew 'ffmpeg'
brew 'imagemagick'

# Ergodox & Planck
brew 'qmk/qmk/qmk'
tap 'osx-cross/avr'
tap 'osx-cross/arm'
tap 'qmk/qmk'

# Unity
# Disable these because they fail too often when installing
# These packages are required to get autocomplete working with the C# VS Code
# extension from Microsoft
# (This also requires `"omnisharp.useGlobalMono": "always"` be set in VS Code's
# preferences)
# brew 'mono'
# brew 'dotnet'
# Mono & Dotnet dependencies
# brew 'brotli'
# brew 'libssh2'
# brew 'zstd'
# brew 'libmetalink'
# brew 'openldap'
# brew 'curl'

# Games
brew 'nethack'

# Dependencies

# Common Dependencies
brew 'openssl'
brew 'pcre'
brew 'readline'
brew 'xz'
brew 'gmp'
brew 'libffi'

# Vim
brew 'lua'
# Ruby
brew 'libyaml'
# Tmux
brew 'libevent'
# renameutils
brew 'coreutils'
# ffmpeg
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'x264'
brew 'lame'
brew 'xvid'
# imagemagick
brew 'libtool'
brew 'jpeg'
brew 'libtiff'
# Legder
brew 'boost'
# w3m
brew 'bdw-gc'
# mkvtoolnix / mkvtomp4
brew 'fmt'
brew 'guile'
brew 'libmagic'
brew 'mkvtoolnix'
brew 'gpac'
brew 'libebml'
brew 'libmatroska'
brew 'mkvtomp4'

# NeoVim
brew 'cmake'
brew 'libbsd'
brew 'libnsl'
brew 'libuv'
brew 'luv'
brew 'neovim'
brew 'utf8proc'
brew 'icu4c'
brew 'libmetalink'
brew 'unibilium'
brew 'libvterm'
brew 'msgpack'
brew 'ninja'
brew 'libmd'
brew 'libtirpc'
brew 'libtermkey'
brew 'luajit-openresty'
brew 'tree-sitter'
brew 'pcre'

# VR
brew 'scrcpy'

# VS Code
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.github-vscode-theme"
vscode "GrapeCity.gc-excelviewer"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "jmfirth.vsc-space-block-jumper"
vscode "johnpapa.vscode-peacock"
vscode "kavod-io.vscode-jest-test-adapter"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lunaryorn.fish-ide"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "ms-dotnettools.csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "msjsdiag.debugger-for-edge"
vscode "rebornix.ruby"
vscode "ritwickdey.LiveServer"
vscode "RobbOwen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "skyapps.fish-vscode"
vscode "sleistner.vscode-fileutils"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
vscode "travisthetechie.write-good-linter"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
vscode "xaver.clang-format"
vscode "yhirose.FilterText"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
