# Shell
brew 'zsh'
brew 'git'
brew 'tig'
brew 'ripgrep'
# Definitely need for remote servers
brew 'tmux'
brew 'fd'
brew 'nvim'
# Really useful to see diff by word quickly
brew 'git-delta'
brew 'universal-ctags'
brew 'gnu-typist'
brew 'cscope'
# Version of `patch` that supports the `--merge` flag to apply conflicts in file
brew 'gpatch'

# Editor
brew 'vim'
# Homebrew `aspell` is failing to install on macOS
# brew 'aspell'
# `ispell` installs instantly
brew 'ispell'
brew 'editorconfig'

# Languages
# JavaScript
# Do not use homebrew `nvm` because it overrides `NVM_DIR` which causes issues.
# Instead install `nvm` directly.  Ruby
brew 'chruby'
brew 'ruby-install'
# Swift
# Objective-C
brew 'carthage'
# json
brew 'jq'
# cpp
brew 'cmake'
# Generate `compile_commands.json` for `clangd` language server from `make` commands
brew 'bear'

# Special
brew 'pandoc'
brew 'gh'
brew 'cloc'
brew 'ncdu'
# HEAD for truecolor support
brew 'mosh', args: ['HEAD']
brew 'yt-dlp'
# VR
# Use another install method
# brew 'scrcpy'
# `-g, --chgexit`: Watch a command until its output changes, e.g., `watch -g
# "adb devices"`
# brew 'watch'

# Eternal Terminal supports OSC52 for tmux clipboard sync, whereas mosh does not
tap 'MisterTea/et'
brew 'MisterTea/et/et'

# Cask GUI Apps
cask 'alacritty'
cask 'anki'
cask 'blender'
cask 'dosbox-staging'
cask 'gzdoom'
cask 'processing'
cask 'suspicious-package'
cask 'claude-code'
