mas "1Password 7", id: 1333542190
mas "Acorn", id: 1547371478
mas "Amphetamine", id: 937984704
mas "CARROT Weather", id: 993487541
mas "Fantastical", id: 975937182
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "GoodLinks", id: 1474335294
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Microsoft Excel", id: 462058435
mas "MindNode", id: 1289197285
mas "miRack", id: 1468259834
mas "Numbers", id: 409203825
mas "OmniGraffle", id: 1142578753
mas "OmniOutliner", id: 1142578772
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Playgrounds", id: 1496833156
mas "Slack", id: 803453959
mas "Soulver 3", id: 1508732804
mas "Streaks", id: 963034692
mas "Textual IRC Client", id: 1262957439
mas "Things", id: 904280696
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
mas "xScope", id: 889428659
