# Shell
brew 'zsh-syntax-highlighting'
brew 'git'
brew 'tig'
brew 'helix'
brew 'tmux'
brew 'ripgrep'
# Installation of `fd`, `bat`, and `weechat` is failing
brew 'fd'
brew 'bat'
# Support for `lesskey`
brew 'less'
brew 'ncdu'
brew 'git-delta'
brew 'tldr'
brew 'choose-rust'
brew 'nushell'
brew 'zoxide'

# Editor
brew 'aspell', args: ['with-lang-en']
# Head version of `ctags` contains support for Objective-C
brew 'ctags', args: ['HEAD']
# Emacs fails to install for some reason, but don't comment this out otherwise
# it will appear in cleanup
brew 'emacs'
brew 'vim'
brew 'editorconfig'
brew 'sbcl'
brew 'neofetch'
brew 'neovim'
brew 'fish'
brew 'hub'
brew 'gh'
brew 'rename'
# HEAD for truecolor support
brew 'mosh', args: ['HEAD']
brew 'hyperfine'
brew 'sd'

# Languages
# JavaScript
# Do not use homebrew `nvm` because it overrides `NVM_DIR` which causes issues.
# Instead install `nvm` directly.
# Ruby
brew 'chruby'
brew 'ruby-install'
# Python
# This is needed by NeoVim
# Shell
brew 'shfmt'
brew 'shellcheck'
# Rust
brew 'binutils'
brew 'libssh2'
brew 'patchelf'
brew 'wasm-pack'
brew 'rust-analyzer'
# C
brew 'valgrind'
# json
brew 'jq'
brew 'lua-language-server'
# C++
# Also installs `clangd`, `clang`, `lldb`, `lldb-vscode`
brew 'llvm'

# Games
brew 'nethack'

# hub
brew 'util-linux'

# NeoVim
brew 'cmake'
brew 'libbsd'
brew 'libnsl'
brew 'libuv'
brew 'luv'
brew 'neovim'
brew 'utf8proc'
brew 'icu4c'
brew 'libmetalink'
brew 'unibilium'
brew 'libvterm'
brew 'msgpack'
brew 'ninja'
brew 'libmd'
brew 'libtirpc'
brew 'libtermkey'
brew 'luajit-openresty'
brew 'tree-sitter'
brew 'pcre'
