# Shell
brew 'zsh'
brew 'fish'
brew 'git'
brew 'tig'
brew 'fzf'
brew 'helix'
brew 'hexyl'
brew 'tmux'
brew 'ripgrep'
brew 'fd'
brew 'bat'
# Support for `incsearch`
brew 'less'
brew 'choose-rust'
brew 'nushell'
brew 'zoxide'
brew 'nnn'
# Really useful to see diff by word quickly
brew 'git-delta'

# Editor
brew 'aspell'
# Dependency of jinx spell checker in Emacs
# brew 'enchant'
# brew 'vim'
brew 'nvim'
brew 'editorconfig'

# Languages
# JavaScript
# Do not use homebrew `nvm` because it overrides `NVM_DIR` which causes issues.
# Instead install `nvm` directly.
# Ruby
brew 'chruby'
brew 'ruby-install'
# Shell
brew 'shellcheck'
# Swift
# Objective-C
brew 'carthage'
brew 'fastlane'
brew 'clang-format'
# Go
brew 'go'
# json
brew 'jq'
# lua
brew 'lua-language-server'
# rust
brew 'rust-analyzer'

# Special
brew 'pandoc'
brew 'gh'
brew 'cloc'
brew 'ncdu'
# HEAD for truecolor support
brew 'mosh', args: ['HEAD']
brew 'youtube-dl'
brew 'mitmproxy'
brew 'hyperfine'
brew 'sd'

# VR
brew 'scrcpy'

# macOS
brew 'suspicious-package'

# Cask GUI Apps
tap 'homebrew/cask'
# cask 'emacs'
cask 'blender'
cask 'alacritty'

# Animated GIFs, `gifify` dependencies
brew 'ffmpeg'
brew 'imagemagick'
