# Shell
brew 'zsh'
brew 'git'
brew 'tig'
brew 'tmux'
brew 'ripgrep'
brew 'fd'
brew 'zoxide'
brew 'yazi'
# Really useful to see diff by word quickly
brew 'git-delta'
brew 'universal-ctags'
# The GNU version of awk is handy to have in case the built-in version fails to
# parse something for some reason
brew 'gawk'

# Editor
brew 'aspell'
brew 'neovim'
brew 'vim'
brew 'editorconfig'

# Languages
# JavaScript
# Do not use homebrew `nvm` because it overrides `NVM_DIR` which causes issues.
# Instead install `nvm` directly.
# Ruby
brew 'chruby'
brew 'ruby-install'
# Swift
# Objective-C
brew 'carthage'
brew 'clang-format'
# Go
brew 'go'
# json
brew 'jq'
# lua
brew 'lua-language-server'
# Rust
brew 'rust-analyzer'
# Markdown
brew 'marksman'
# Ruby
# Some gems fail to install without `coreutils`
brew 'coreutils'

# Special
brew 'pandoc'
brew 'gh'
brew 'cloc'
brew 'ncdu'
# HEAD for truecolor support
brew 'mosh', args: ['HEAD']
brew 'yt-dlp'
brew 'hyperfine'
# Shows whitespace nicer than xxd
brew 'hexyl'
# VR
# Use another install method
# brew 'scrcpy'
brew 'fzf'
brew 'fish'
brew 'bat'
brew 'helix'
# `-g, --chgexit`: Watch a command until its output changes, e.g., `watch -g
# "adb devices"`
brew 'watch'

# macOS
brew 'suspicious-package'

# Cask GUI Apps
tap 'homebrew/cask'
cask 'blender'
cask 'anki'
cask 'alacritty'
cask 'processing'

# Media
brew 'ffmpeg'
brew 'imagemagick'

# Games
brew 'nethack'
