# Shell
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'fish'
brew 'git'
brew 'tig'
brew 'helix'
brew 'tmux'
brew 'fasd'
brew 'ripgrep'
brew 'fd'
brew 'bat'
brew 'mas'
brew 'rename'
# Support for `lesskey`
brew 'less'
brew 'git-delta'
brew 'tldr'

# Editor
brew 'aspell'
brew 'vim'
brew 'nvim'
brew 'editorconfig'

# ctags
# `svn` seems to be an unlisted dependency of `ctags` so it needs to be
# installed first
brew 'svn'
# `HEAD` is required for Objective-C support
brew 'ctags', args: ['HEAD']

# Languages
# JavaScript
# Do not use homebrew `nvm` because it overrides `NVM_DIR` which causes issues.
# Instead install `nvm` directly.
# Ruby
brew 'chruby'
brew 'ruby-install'
# Shell
brew 'shfmt'
brew 'shellcheck'
# Swift
brew 'carthage'
brew 'swiftlint'
brew 'swiftformat'
brew 'fastlane'
# Objective-C
brew 'clang-format'
# mysql
brew 'mysql'
# MIDI
brew 'midicsv'
# C
tap 'LouisBrunner/valgrind'
brew 'LouisBrunner/valgrind/valgrind', args: ['HEAD']
# Lisp
brew 'sbcl'
# Go
brew 'go'
brew 'jq'
brew 'lua-language-server'
brew 'rust-analyzer'

# Special
brew 'pandoc'
brew 'hub'
brew 'gh'
brew 'cloc'
brew 'ncdu'
# HEAD for truecolor support
brew 'mosh', args: ['HEAD']
brew 'youtube-dl'
brew 'wdiff'
brew 'mitmproxy'
brew 'hyperfine'
brew 'sd'

# Railwaycat
# tap 'railwaycat/emacsmacport'
# brew 'emacs-mac'
# The `with-no-frame-refocus` options on this version of Emacs fixes the issue
# of switching spaces when the last Emacs window on a space closes.
# Note after installing run `brew info emacs-plus` for the command to symlink
# to applications
tap 'd12frosted/emacs-plus'
brew 'emacs-plus', args: ['with-elrumo2-icon', 'with-no-frame-refocus']

# Cask GUI Apps
tap 'homebrew/cask'
# cask 'emacs'
cask 'blender'
cask 'kitty'
cask 'alacritty'

# Animated GIFs, `gifify` dependencies
brew 'ffmpeg'
brew 'imagemagick'

# Unity
# Disable these because they fail too often when installing
# These packages are required to get autocomplete working with the C# VS Code
# extension from Microsoft
# (This also requires `"omnisharp.useGlobalMono": "always"` be set in VS Code's
# preferences)
# brew 'mono'
# brew 'dotnet'
# # Mono & Dotnet dependencies
# brew 'brotli'
# brew 'libssh2'
# brew 'zstd'
# brew 'libmetalink'
# brew 'openldap'
# brew 'curl'

# Dependencies

# Common Dependencies
brew 'openssl'
brew 'pcre'
brew 'readline'
brew 'xz'
brew 'gmp'
brew 'libffi'

# Vim
brew 'lua'
# Ruby
brew 'libyaml'
# Tmux
brew 'libevent'
# renameutils
brew 'coreutils'
# ffmpeg
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'x264'
brew 'lame'
brew 'xvid'
# imagemagick
brew 'libtool'
brew 'jpeg'
brew 'libtiff'
# Legder
brew 'boost'
# w3m
brew 'bdw-gc'

# NeoVim
# brew 'cmake'
# brew 'libbsd'
# brew 'libnsl'
# brew 'libuv'
# brew 'luv'
# brew 'neovim'
# brew 'utf8proc'
# brew 'icu4c'
# brew 'libmetalink'
# brew 'unibilium'
# brew 'libvterm'
# brew 'msgpack'
# brew 'ninja'
# brew 'libmd'
# brew 'libtirpc'
# brew 'libtermkey'
# brew 'luajit-openresty'
# brew 'tree-sitter'
# brew 'pcre'
